{
  "ids": {
    "site_id": "craig-plumbing-and-electrical",
    "place_id": "ChIJVXayhTvvkYgR4RoREmjqffA",
    "google_id": "0x8891ef3b85b27655:0xf07dea6812111ae1",
    "owner_id": 110024721489273610286
  },
  "basic_info": {
    "name": "Craig Plumbing and Electrical",
    "reviews_link": "https://search.google.com/local/reviews?placeid=ChIJVXayhTvvkYgR4RoREmjqffA&q=plumber,+36320,+Cottonwood,+AL,+US&authuser=0&hl=en&gl=US",
    "phone": "+1 334-818-0597",
    "query": "plumber, 36320, Cottonwood, AL, US",
    "name_for_emails": "Craig Plumbing And Electrical",
    "site": "",
    "subtypes": "Plumber, Electrical installation service, Electrician, Service establishment",
    "category": "Plumber",
    "type": "Plumber",
    "full_address": "",
    "borough": "",
    "street": "",
    "city": "",
    "postal_code": "",
    "state": "",
    "us_state": "",
    "country": "",
    "country_code": "",
    "latitude": 31.5273744,
    "longitude": -86.307751,
    "h3": "8944ecdb2b7ffff",
    "time_zone": "America/Chicago",
    "area_service": "TRUE",
    "rating": 3.6,
    "reviews": 16,
    "photos_count": 14,
    "photo": "https://lh5.googleusercontent.com/p/AF1QipN8iMnWmC5lS2H0_jqThwwE0w2fQ3hENhLUms5O=w800-h500-k-no",
    "street_view": "https://lh5.googleusercontent.com/p/AF1QipN8iMnWmC5lS2H0_jqThwwE0w2fQ3hENhLUms5O=w1600-h1000-k-no",
    "working_hours": "{\"Monday\": \"Open 24 hours\", \"Tuesday\": \"Open 24 hours\", \"Wednesday\": \"Open 24 hours\", \"Thursday\": \"Open 24 hours\", \"Friday\": \"Open 24 hours\", \"Saturday\": \"Open 24 hours\", \"Sunday\": \"Open 24 hours\"}",
    "business_status": "OPERATIONAL",
    "about": "{}",
    "logo": "https://lh4.googleusercontent.com/-SrENLHVAJpY/AAAAAAAAAAI/AAAAAAAAAAA/6PgKFg6bXtI/s44-p-k-no-ns-nd/photo.jpg",
    "verified": "TRUE",
    "owner_title": "Craig Plumbing and Electrical",
    "owner_link": "https://www.google.com/maps/contrib/110024721489273610286",
    "facebook": "https://www.facebook.com/people/Craig-Plumbing-and-Electrical/100063567549060/",
    "email_1": "craigjulie1992@gmail.com",
    "PrimaryColor": "#dab434",
    "SecondaryColor": "#a0784f"
  },
  "website_content": {
    "aboutUs": "Craig Plumbing and Electrical is a locally owned and operated service provider, offering comprehensive plumbing, electrical, and home repair solutions to residents in and around Andalusia, Alabama. Our team of skilled professionals specializes in a wide range of services, from intricate plumbing installations to complex electrical work, ensuring your home or business receives the highest quality service.",
    "whyChooseUs": {
      "mainPitch": "Trusted local experts delivering reliable, efficient, and code-compliant plumbing and electrical services.",
      "sellingPoints": [
        "State-licensed and insured professionals adhering to the highest industry standards.",
        "Prompt response times and flexible scheduling to accommodate your needs.",
        "Meticulous attention to detail and a commitment to leaving your property clean and tidy."
      ]
    }
  },
  "research": "## Business Information:\n\n### Alabama Business Registration/License Details\n- Craig Plumbing and Electrical is registered and operates under the oversight of the State of Alabama Plumbers & Gas Fitters Examining Board and the Alabama Electrical Contractors Board. The business must comply with the licensing requirements of these boards[1].\n\n### Physical Location and Service Areas\n- The business is located at 1028 S Cotton St, Andalusia, AL 36420-4937. Although the primary address listed is on Cotton St, another source mentions an address at 14519 Cottonwood Dr, Andalusia, AL 36420[1][4].\n\n### Hours and Payment Methods\n- There is no specific information available on the business hours or payment methods. However, it is common for such services to offer various payment options including cash, credit cards, and checks.\n\n### Years in Operation\n- Craig Plumbing and Electrical has been in business since January 10, 1981, making it over 44 years in operation[1].\n\n## Services & Specialties:\n\n### Types of Services Offered\n- The business offers a wide range of services including plumbing, electrical work, drywall repairs, roofing repairs, flooring repairs, and more. Specific services include interior trim and moldings installation and repair, deck or porch repair, interior and exterior door installation, and various plumbing and electrical tasks[2].\n\n### Service Areas Covered\n- The service area is primarily around Andalusia, Alabama, though the exact geographic scope of their services is not detailed.\n\n### Emergency Service Availability\n- While there is no explicit mention of 24/7 emergency services, customer reviews indicate that the business is responsive to urgent needs, such as fixing a leaking kitchen tap or a non-functional toilet[3].\n\n### Any Listed Prices or Rates\n- There is no detailed pricing information available. However, customers have mentioned that the prices are fair and offer good value for the services provided[3].\n\n## Customer Reviews & Reputation:\n\n### Review Summaries with Specific Examples\n- Customers have praised the business for its professionalism, punctuality, and customer satisfaction. Examples include prompt and efficient service for electrical inspections (EICR), fixing a leaking radiator, and replacing a toilet unit. Customers have also appreciated the thoroughness and tidiness of the work done[3].\n\n### BBB Rating and Status\n- Craig Plumbing and Electrical is not a BBB Accredited Business but has an A+ BBB rating. The business has been listed with the BBB since September 24, 2018[1].\n\n### Common Customer Feedback Themes\n- Common themes include praise for the owner's friendliness, professionalism, and reliability. Customers have also highlighted the business's ability to complete jobs efficiently and to a high standard[3].\n\n### Response to Reviews\n- There is no information available on how the business responds to reviews, as the sources provided do not include any responses from the business owner.\n\n## Owner & Staff:\n\n### Owner/Management Information\n- The business is owned by Mr. Terry Craig, who is also the primary contact for customer inquiries and services[1].\n\n### Staff Qualifications\n- There is no detailed information available on the qualifications of the staff beyond the owner. However, customer reviews suggest that the staff, including individuals like Mark, are knowledgeable and professional[3].\n\n### Professional Certifications\n- The business operates under the necessary state licenses from the State of Alabama Plumbers & Gas Fitters Examining Board and the Alabama Electrical Contractors Board, indicating that the owner and staff have the required professional certifications[1].",
  "review_trends": {
    "ownerName": "Terry",
    "ownerConfidence": 80,
    "servicesMentioned": [
      "pipe replacement",
      "water heater",
      "breaker panel box",
      "water line blockage",
      "bathtub installation"
    ],
    "firstReviewDate": "2019-09-10",
    "last30": 1,
    "last60": 1,
    "last90": 1,
    "last180": 2,
    "last365": 7
  }
}