{
  "fussell-plumbing": "Based on the information provided and the available online sources, here is a detailed report on Fussell Plumbing, although it appears there might be some confusion or mix-up with the name and location.\n\n## Business Name and Location\nThe business name provided is \"Fussell Plumbing,\" but the phone number and Google Place ID do not match any of the sources found. However, there is a mention of a business named \"Fussell Plumbing LLC\" in a different location.\n\n## Fussell Plumbing LLC in Franklinton, LA\n- This company is registered in Franklinton, Louisiana, and is listed on Bizapedia[4].\n- The Registered Agent on file for this company is Ronald Fussell.\n- The company's address is 29277 Hayes Creek Road, Franklinton, LA 70438.\n\n## Services and History\nThere is no detailed information available specifically for \"Fussell Plumbing\" with the provided phone number and Google Place ID. However, here are some general observations:\n\n- **Fussell Plumbing LLC in Franklinton, LA**: There are no detailed services or history provided for this specific company in the available sources. Bizapedia only provides registration and contact information.\n\n## Other Fussell Businesses\nTo provide some context, there are other businesses with the name \"Fussell\" that offer related services, though they are not directly related to \"Fussell Plumbing\" with the given details:\n\n- **Coolray Heating and Cooling, LLC**: Founded by \"Cool-Ray\" Fussell, this company is based in the Atlanta area and provides heating, cooling, plumbing, and other home services. It has a 50-year history and is locally owned and operated[1].\n- **Fussell Well Drilling**: Based in Polk County, Florida, this company provides well drilling, pump installation, repair, and water treatment services. It has been serving the area since 1998[2][3][5].\n\nGiven the lack of specific information on \"Fussell Plumbing\" with the provided details, it appears that this business might not have a significant online presence or the details provided do not match any well-documented businesses under this name. If you have any additional details or if there was a mix-up with the name or location, it might help to clarify the search.",
  "jason-s-drain-service": "### Business Overview\n\n**Jason's Drain Service** is a plumbing business located in Cottondale, Alabama.\n\n### Address and Contact Information\n- Address: 2010 Mountainbrook Dr, Cottondale, AL 35453[1][4][5]\n- Phone: +1 205-764-8182[1][4][5]\n\n### Services\nJason's Drain Service offers a wide range of plumbing services, including but not limited to:\n- Drain Cleaning\n- Clogged Drains\n- Sewer Repair\n- Sewer Systems\n- Leak Detection\n- Leaks\n- Garbage Disposals\n- Hot Water Heaters\n- Toilets\n- Tubs\n- Water Piping\n- Sewage Lines\n- Sewage Pipes\n- Residential plumbing services[3][5]\n\n### Reviews and Reputation\nThe business has an excellent reputation, with a 4.9 out of 5 stars rating based on 17 reviews. The majority of the reviews (94%) are 5-star, praising the service for its professionalism, promptness, reasonable pricing, and high-quality work[1].\n\n### Owner/Operator\nThe business is operated by Jason Hunter, as indicated by the contact information[5].\n\n### History\nThere is no specific information available on the exact date of establishment or the history of Jason's Drain Service. However, the business appears to be well-established, given the number of reviews and the consistent positive feedback.\n\n### Additional Information\n- **Licensing and Insurance**: Jason's Drain Service is listed as licensed and insured[3].\n- **Service Area**: The business serves the greater Cottondale, AL area[1].\n- **Customer Feedback**: Customers praise the business for its great communication skills, prompt service, and reasonable prices. Many reviewers have used the service multiple times and highly recommend it[1].\n\nThere is no information available on any significant milestones, awards, or specific events related to Jason's Drain Service, but the consistent positive reviews and the comprehensive list of services suggest a reliable and trustworthy plumbing service.",
  "salser-plumbing-and-septic-service-llc": "Here is a detailed report on Salser Plumbing and Septic Service, LLC based on the available information:\n\n## Business Overview\n- **Business Name**: Salser Plumbing and Septic Service, LLC\n- **Location**: 90 McClinton Dr, Vincent, AL 35178-8104[1].\n\n## Contact Information\n- **Phone Number**: +1 205-965-0444[1].\n- **Email**: Available through the Better Business Bureau (BBB) profile, though the specific email address is not listed publicly[1].\n\n## Principal Contacts\n- **Mr. Brandon Salser**: Listed as both the principal and customer contact[1].\n\n## Accreditation and Ratings\n- **BBB Accreditation**: Salser Plumbing is not a BBB Accredited Business. To become accredited, a business must agree to BBB Standards for Trust and pass the BBB's vetting process[1].\n- **BBB Rating**: Despite not being accredited, Salser Plumbing has an A+ rating from the BBB[1].\n\n## Business History\n- **BBB File Opened**: The BBB file for Salser Plumbing was opened on May 23, 2013[1].\n\n## Services\n- **Plumbing Services**: Salser Plumbing offers general plumbing services.\n- **Septic Services**: Specifically, they provide septic tank pumping. For example, they charge $350 to pump out septic tanks in and around Chelsea, AL, though prices may vary for other locations[2].\n\n## Licensing\n- **State Licensing**: The business is associated with the State of Alabama Plumbers & Gas Fitters Examining Board, indicating they are licensed to operate in Alabama[1].\n\n## Reputation and Reviews\n- While there is no detailed review section available from the sources, the A+ BBB rating suggests a positive reputation.\n- On other forums, users mention Salser Plumbing as an option for septic tank services, indicating some level of community recognition and use[2].\n\n## Additional Information\n- **BuildZoom Score**: Although the specific BuildZoom page is inaccessible due to regional restrictions, it is mentioned that Salser Plumbing has a BuildZoom score of 96, which ranks in the top 20% of Alabama licensed contractors. Their license was verified as active[4].\n\nIn summary, Salser Plumbing and Septic Service, LLC is a locally operated business in Vincent, AL, offering plumbing and septic services, with a good reputation as indicated by their A+ BBB rating and positive community mentions.",
  "hydrotech-plumbing-llc": "Based on the provided information and additional research, here is a detailed report on HydroTech Plumbing LLC, specifically the one located in Guntersville, Alabama:\n\n## Business Overview\n- **Business Name**: HydroTech Plumbing LLC\n- **Location**: 215 Willow Lake Circle, Guntersville, AL 35976[1][4]\n- **Phone Number**: +1 256-572-9349[1]\n\n## Business Details\n- **Type of Entity**: Domestic Limited Liability Company (LLC)[1][4]\n- **Date of Formation**: August 8, 2019[4]\n- **Entity ID Number**: 000584289[4]\n- **Status**: Active[4]\n- **Years in Business**: Approximately 5 years as of the current date[1][4]\n\n## Ownership and Management\n- **Owner**: Mr. Michael Erby[1][4]\n\n## Services Offered\n- HydroTech Plumbing LLC provides a range of plumbing services including:\n  - Commercial and residential plumbing repair\n  - Remodel work\n  - It is likely they offer other standard plumbing services, but the specific sources do not detail beyond repair and remodel work[1].\n\n## Accreditation and Ratings\n- **BBB Accreditation**: HydroTech Plumbing LLC is not a BBB Accredited Business. However, it has an A+ BBB rating, which is calculated based on various factors including complaint history, type of business, and overall customer satisfaction[1].\n\n## Additional Information\n- **Local BBB**: The business is listed under the BBB serving North Alabama[1].\n- **State Licensing**: The business is likely compliant with state regulations, as indicated by the reference to the State of Alabama Plumbers & Gas Fitters Examining Board[1].\n\nIt is important to note that there are other businesses with similar names in different locations (e.g., Kansas City, Eugene, OR), but the above information pertains specifically to the HydroTech Plumbing LLC located in Guntersville, Alabama[2][3].",
  "strickland-plumbing-maintenance": "### Business Overview\n\n**Strickland Plumbing & Maintenance** is a plumbing service provider based in Pelham, Alabama.\n\n## Location and Contact Information\n- The business is located at 1839 Chanbury Cir, Pelham, AL 35124[1][3][4].\n- The phone number is (205) 368-0503[1][3][4].\n\n## Business Structure and Licensing\n- Strickland Plumbing & Maintenance operates as a sole proprietorship[1].\n- The business is owned by Mr. David Strickland[1].\n- It holds a license (MPG-1034) issued by the State of Alabama Plumbers & Gas Fitters Examining Board, with an expiration date of December 31, 2024[1].\n\n## History\n- The business was started on January 1, 2018[1].\n- The BBB file for this business was opened on June 6, 2018[1].\n\n## Services\n- Strickland Plumbing & Maintenance offers a wide range of plumbing services, including residential and commercial plumbing, plumbing renovations, plumbing fixtures, and plumbing supplies[1][4].\n- There is no specific mention of HVAC services for this particular business, unlike the similarly named business in Texas.\n\n## Accreditation and Ratings\n- Strickland Plumbing & Maintenance is not accredited by the Better Business Bureau (BBB), although it has an A+ BBB rating[1].\n\n## Additional Information\n- The business encourages customers to verify its licensing and other professional requirements through the State of Alabama Plumbers & Gas Fitters Examining Board[1].\n\n### Key Facts\n\n- **Years in Business:** As of the current date, the business has been in operation for approximately 7 years[1].\n- **Licensing Agency:** State of Alabama Plumbers & Gas Fitters Examining Board, located at 216 Aquarius Dr STE 319, Homewood, AL 35209, Phone: (205) 945-4857[1].\n- **Services Focus:** Primarily on plumbing services, including renovations, fixtures, and supplies, but does not include HVAC services unlike the Texas-based Strickland Plumbing & HVAC, Inc.[1][4].\n\nIt is important to note that there is another business named Strickland Plumbing & HVAC, Inc. based in Lufkin, Texas, which offers both plumbing and HVAC services and has a distinct history and service profile[2][5]. The information provided here pertains specifically to the Alabama-based Strickland Plumbing & Maintenance.",
  "forceUpdateTimestamp": "1737021803.9291127"
}