{
  "fussell-plumbing": {
    "rawText": "Fussell Plumbing Company, LLC, is a domestic limited liability company registered in Alabama. Here are the key details available about this business:\n\nFussell Plumbing Company, LLC, was formed on June 28, 2023, and its entity ID number is 001086694. The company is currently operational, with its status listed as \"Exists\"[5].\n\nThe company is based in Guntersville, Alabama, with its registered office street address at 64 Edgewood Lane, Guntersville, AL 35976. The registered office mailing address is also in Guntersville, at 4213 Lakecrest Drive, Guntersville, AL 35976[5].\n\nAs of the latest update on August 18, 2023, the company has been operating for approximately 1 year, 6 months, and 17 days[5].\n\nThere is no extensive customer feedback or detailed service information available online for Fussell Plumbing Company, LLC, as it is a relatively new establishment. The lack of reviews or testimonials suggests that the company may still be building its client base and reputation.\n\nNo other significant information, such as the services offered, pricing, or specific customer experiences, is readily available on the internet for Fussell Plumbing Company, LLC, at this time. Any additional details would require direct contact with the company or waiting for more information to become publicly available.",
    "error": "GPT returned unparseable JSON",
    "gptOutput": "[ERROR calling GPT => \n\nYou tried to access openai.ChatCompletion, but this is no longer supported in openai>=1.0.0 - see the README at https://github.com/openai/openai-python for the API.\n\nYou can run `openai migrate` to automatically upgrade your codebase to use the 1.0.0 interface. \n\nAlternatively, you can pin your installation to the old version, e.g. `pip install openai==0.28`\n\nA detailed migration guide is available here: https://github.com/openai/openai-python/discussions/742\n]"
  },
  "jason-s-drain-service": {
    "rawText": "Jason's Drain Service is a plumbing business based in Alabama, specifically operating in the areas around Cottondale and Ralph.\n\nThe business is owned and operated by Jason Hunter, who is praised by customers for his professionalism, experience, and prompt service. Jason's Drain Service is listed under the category of plumbing contractors and offers a wide range of services. These include drain cleaning, clogged drain repair, sewer line and pipe repairs, leak detection, and various other plumbing-related services such as fixing boilers, furnaces, garbage disposals, hot water heaters, and ventilation systems[1][2][5].\n\nThe company is known for its competitive pricing, with most drain services starting at $65.00 and plumbing repair rates at $75.00 per hour[1][5]. Customers have consistently left positive reviews, highlighting the company's reliability, honesty, and the quality of work. Many reviewers have mentioned that Jason and his crew are friendly, professional, and efficient, often responding to service calls on the very next day[2][5].\n\nJason's Drain Service operates from Monday to Friday from 8:00 a.m. to 5:00 p.m. and is closed on weekends. The business is located at 14366 Wells Creek Ln, Ralph, AL 35480, although there is also a mention of an address in Cottondale, AL, which could indicate multiple service areas or a secondary location[2][4][5].\n\nThe company is licensed and insured, which adds to the trust and peace of mind for its customers. The services provided are not limited to residential clients but also extend to light commercial customers in the area[2].\n\nCustomer reviews across various platforms consistently rate Jason's Drain Service with 5-star ratings, with reviewers appreciating the prompt communication, reasonable prices, and the cleanliness of the work done. Some reviewers have mentioned using the service multiple times over the years and highly recommending it to others[2][5].\n\nOverall, Jason's Drain Service is well-regarded in the community for its reliable, efficient, and professional plumbing services.",
    "error": "GPT returned unparseable JSON",
    "gptOutput": "[ERROR calling GPT => \n\nYou tried to access openai.ChatCompletion, but this is no longer supported in openai>=1.0.0 - see the README at https://github.com/openai/openai-python for the API.\n\nYou can run `openai migrate` to automatically upgrade your codebase to use the 1.0.0 interface. \n\nAlternatively, you can pin your installation to the old version, e.g. `pip install openai==0.28`\n\nA detailed migration guide is available here: https://github.com/openai/openai-python/discussions/742\n]"
  },
  "salser-plumbing-and-septic-service-llc": {
    "rawText": "Salser Plumbing and Septic Service, LLC, is a plumbing business located in Vincent, Alabama. The company operates from the address 90 McClinton Dr, Vincent, AL 35178.\n\nThe business is owned and managed by Mr. Brandon Salser, who is listed as both the principal and customer contact[1][5].\n\nSalser Plumbing is not accredited by the Better Business Bureau (BBB), although it has been listed with the BBB since May 23, 2013. Despite the lack of accreditation, the business has a BBB rating of A+[1].\n\nThe company primarily operates in the plumbing and septic system construction industry. It is registered with the State of Alabama Plumbers & Gas Fitters Examining Board, which is located at 216 Aquarius Dr STE 319, Homewood, AL 35209[1][4].\n\nCustomers have provided positive feedback about Salser Plumbing, describing the service as reliable, dependable, and professional. Reviews highlight the promptness and quality of the work performed by the company[2].\n\nFor contact, Salser Plumbing can be reached at (205) 965-0444, and there is an additional phone number listed as (205) 672-1011[5].\n\nThe business does not have any reviews on the Yellow Pages or BBB websites, but it is listed among other local plumbing services in the area, indicating its presence and availability for various plumbing and septic needs[2][5].\n\nThere is no detailed financial or employee information available publicly for Salser Plumbing and Septic Service, LLC, as such data is typically not disclosed for small, privately-owned businesses unless through specific business research services[4].\n\nIn summary, Salser Plumbing and Septic Service, LLC, is a locally operated business in Vincent, Alabama, known for its reliable and professional plumbing services, though it lacks BBB accreditation. It is managed by Brandon Salser and has been in operation since at least 2013.",
    "error": "GPT returned unparseable JSON",
    "gptOutput": "[ERROR calling GPT => \n\nYou tried to access openai.ChatCompletion, but this is no longer supported in openai>=1.0.0 - see the README at https://github.com/openai/openai-python for the API.\n\nYou can run `openai migrate` to automatically upgrade your codebase to use the 1.0.0 interface. \n\nAlternatively, you can pin your installation to the old version, e.g. `pip install openai==0.28`\n\nA detailed migration guide is available here: https://github.com/openai/openai-python/discussions/742\n]"
  },
  "hydrotech-plumbing-llc": {
    "rawText": "Hydrotech Plumbing LLC, based in Guntersville, Alabama, is a domestic limited liability company that was registered on August 8, 2019, in Marshall County. The company's entity ID number is 000584289, and it has been operating for approximately 5 years and 5 months as of the last update in 2020[4].\n\nThe company is located at 215 Willow Lake Circle, Guntersville, AL 35976, and is owned by Mr. Michael Erby[1][4].\n\nHydrotech Plumbing LLC offers a range of plumbing services, including commercial and residential plumbing repair, as well as some remodel work. They do not have BBB accreditation, although they have an A+ BBB rating, which is calculated based on various factors including complaint history, customer reviews, and the business's response to complaints[1].\n\nThe company is listed under the business categories of plumbers and is regulated by the State of Alabama Plumbers & Gas Fitters Examining Board, which is based in Birmingham, AL[1].\n\nThere is no extensive customer review data available for this specific Hydrotech Plumbing LLC in Alabama, but the general profile suggests a commitment to quality service and customer satisfaction.\n\nIt is important to note that there are other plumbing companies with similar names, such as Hydrotech Plumbing LLC in Eugene, Oregon, which offers different services and operates independently of the Alabama-based company[2].\n\nIn summary, Hydrotech Plumbing LLC in Alabama is a relatively new company with a focus on residential and commercial plumbing services, operated by Mr. Michael Erby, and has a positive but limited public profile.",
    "error": "GPT returned unparseable JSON",
    "gptOutput": "[ERROR calling GPT => \n\nYou tried to access openai.ChatCompletion, but this is no longer supported in openai>=1.0.0 - see the README at https://github.com/openai/openai-python for the API.\n\nYou can run `openai migrate` to automatically upgrade your codebase to use the 1.0.0 interface. \n\nAlternatively, you can pin your installation to the old version, e.g. `pip install openai==0.28`\n\nA detailed migration guide is available here: https://github.com/openai/openai-python/discussions/742\n]"
  },
  "strickland-plumbing-maintenance": {
    "rawText": "Strickland Plumbing & Maintenance, based in Pelham, Alabama, is a sole proprietorship owned and managed by Mr. David Strickland. Here are the key details about the business:\n\nStrickland Plumbing & Maintenance has been in operation since January 1, 2018, indicating it has been in business for approximately 7 years as of the current date[1].\n\nThe business is located at 1839 Chanbury Cir, Pelham, AL 35124-1454. It operates under a license issued by the State of Alabama Plumbers & Gas Fitters Examining Board, with the license number MPG-1034, which is set to expire on December 31, 2024[1].\n\nStrickland Plumbing & Maintenance is not accredited by the Better Business Bureau (BBB), although it has a BBB rating of A+. To become BBB accredited, a business must agree to BBB Standards for Trust and pass the BBB's vetting process[1].\n\nThe business provides various plumbing services, including plumbing renovation, commercial plumbing, plumbing fixtures, plumbing and heating, and plumbing supplies. It is also associated with maintenance services, though the specific scope of these services is not detailed in the available sources[1].\n\nIn addition to the plumbing license, Strickland Plumbing & Maintenance also holds a Handyman license (#EMP-5941) with the Alabama Contractors License Board, as per information from BuildZoom, although this source is currently unavailable due to regional restrictions[4].\n\nCustomer feedback and reviews for this specific business in Alabama are not readily available in the sources provided, but it is clear that the business is focused on delivering quality workmanship and customer service, similar to other businesses with the same name in different locations[1][2].\n\nFor any licensing or regulatory inquiries, one can contact the State of Alabama Plumbers & Gas Fitters Examining Board at 216 Aquarius Dr STE 319, Homewood, AL 35209, or by calling (205) 945-4857[1].\n\nOverall, Strickland Plumbing & Maintenance in Alabama appears to be a locally operated business with a focus on providing reliable and professional plumbing services, though it lacks BBB accreditation and detailed customer reviews in the available sources.",
    "error": "GPT returned unparseable JSON",
    "gptOutput": "[ERROR calling GPT => \n\nYou tried to access openai.ChatCompletion, but this is no longer supported in openai>=1.0.0 - see the README at https://github.com/openai/openai-python for the API.\n\nYou can run `openai migrate` to automatically upgrade your codebase to use the 1.0.0 interface. \n\nAlternatively, you can pin your installation to the old version, e.g. `pip install openai==0.28`\n\nA detailed migration guide is available here: https://github.com/openai/openai-python/discussions/742\n]"
  },
  "forceUpdateTimestamp": "1737003984.388947"
}