{
  "fussell-plumbing": "Based on the provided details, Fussell Plumbing, located in Eva, AL, US, is likely to offer a variety of plumbing services. Here are some potential services they might provide:\n\n1. **Emergency Plumbing Services**: Immediate assistance for urgent plumbing issues like burst pipes, leaks, and clogs.\n2. **Leak Detection and Repair**: Identifying and fixing leaks in pipes, faucets, and appliances.\n3. **Drain Cleaning**: Clearing clogs and blockages in drains to ensure proper water flow.\n4. **Toilet Repair and Installation**: Fixing or replacing toilets, including issues with flushing mechanisms and tank problems.\n5. **Sink and Faucet Installation/Repair**: Installing new sinks and faucets or repairing existing ones.\n6. **Water Heater Services**: Installing, repairing, and maintaining water heaters to ensure hot water supply.\n7. **Pipe Installation/Repair**: Installing new pipes or repairing damaged ones for both residential and commercial properties.\n8. **Garbage Disposal Installation/Repair**: Fixing or replacing garbage disposals to prevent clogs and maintain kitchen hygiene.\n9. **Sewer Line Inspection and Repair**: Diagnosing and fixing issues with sewer lines to prevent backups and overflows.\n10. **Plumbing Maintenance**: Regular maintenance checks to prevent future plumbing issues and ensure the longevity of plumbing systems.\n11. **Backflow Prevention Services**: Installing backflow preventers to protect water quality by preventing contaminated water from entering the clean water supply.\n12. **Frozen Pipe Thawing**: Thawing frozen pipes during winter months to prevent damage and ensure continuous water supply.\n\nThese services are typical for a professional plumbing business and are likely to be offered by Fussell Plumbing based on their category and location[1].",
  "jason-s-drain-service": "Based on the provided details, Jason's Drain Service, a plumbing business located in Cottondale, AL, might offer the following services:\n\n1. **Drain Cleaning**: Services to clear clogs and blockages in drains, including kitchen and bathroom sinks, toilets, and showers.\n2. **Pipe Repair**: Repairing damaged or leaking pipes to prevent water damage and ensure proper water flow.\n3. **Leak Detection**: Identifying and fixing hidden leaks in pipes to prevent water waste and structural damage.\n4. **Toilet Repair**: Fixing issues with toilets, including clogged toilets, running toilets, and toilet installation.\n5. **Water Heater Services**: Maintenance, repair, and installation of water heaters to ensure hot water supply.\n6. **Sewer Line Repair**: Fixing issues with sewer lines to prevent backups and overflows.\n7. **Emergency Plumbing Services**: 24/7 emergency services for urgent plumbing issues like burst pipes or sudden leaks.\n8. **Plumbing Maintenance**: Regular maintenance checks to prevent future plumbing problems and ensure the longevity of plumbing systems.\n9. **Faucet Installation/Repair**: Installing or repairing faucets in kitchens and bathrooms.\n10. **Garbage Disposal Services**: Repairing or replacing garbage disposals to keep kitchen drains clear.\n\nThese services are typical for a plumbing business and are likely to be offered by Jason's Drain Service based on their operational status and customer reviews[1].",
  "salser-plumbing-and-septic-service-llc": "Based on the provided details, Salser Plumbing and Septic Service, LLC likely offers the following plumbing services:\n\n1. **Emergency Plumbing Services**: For urgent issues like burst pipes, leaks, or sudden plumbing failures.\n2. **Leak Detection and Repair**: Identifying and fixing hidden leaks to prevent water damage.\n3. **Drain Cleaning**: Clearing clogged drains and sewers to ensure proper water flow.\n4. **Toilet Repair and Installation**: Fixing or replacing toilets, including issues with flushing mechanisms and tank problems.\n5. **Sink and Faucet Installation/Repair**: Servicing sinks and faucets, including fixing leaks, replacing parts, and installing new fixtures.\n6. **Water Heater Services**: Repairing, maintaining, and installing water heaters to ensure hot water supply.\n7. **Garbage Disposal Installation/Repair**: Fixing or replacing garbage disposals to keep kitchen drains clear.\n8. **Sewer Line Inspection and Repair**: Diagnosing and fixing issues with sewer lines to prevent backups and overflows.\n9. **Septic System Services**: Maintaining and repairing septic systems, including pumping tanks and inspecting systems for potential issues.\n10. **Plumbing Maintenance**: Regular check-ups to prevent future plumbing problems and ensure the overall health of the plumbing system.\n\nThese services are typical for a plumbing company and are likely offered by Salser Plumbing and Septic Service, LLC based on their category and location in Harpersville, AL.",
  "hydrotech-plumbing-llc": "Based on the provided details and the typical services offered by plumbers, HydroTech Plumbing LLC in Joppa, AL, might provide the following potential plumbing services:\n\n1. **Emergency Plumbing Services**:\n   - 24/7 emergency response for sudden plumbing issues[1][3][4].\n\n2. **Drain Cleaning and Maintenance**:\n   - HydroScrub drain cleaning for commercial properties[1].\n   - Snaking drain lines and ensuring drains are cleared to the main sewer line[2].\n\n3. **Sewer Line Repair and Installation**:\n   - Diagnosing and repairing sewer line issues[3].\n   - Constructing new sewer lines for building from the ground up[3].\n\n4. **Water Line Replacement**:\n   - Trenchless water line replacement to minimize excavation and disruption[3].\n\n5. **Plumbing System Maintenance**:\n   - Regular inspections to ensure the plumbing system is in working order and up to date[4].\n   - Preventive maintenance to avoid leaks, dangers, and regulatory issues[4].\n\n6. **Installation of New Plumbing Systems**:\n   - Installing new water service lines, gas lines, and drainage systems[4].\n   - Upgrading existing plumbing systems to more energy-efficient and eco-friendly options[4].\n\n7. **Grease Trap Installation and Replacement**:\n   - Keeping grease trap plumbing systems in top condition to ensure efficiency and compliance with local regulations[4].\n\n8. **Leak Repair and Detection**:\n   - Identifying and repairing leaks in commercial plumbing systems[2][4].\n\n9. **Commercial Plumbing Permits and Inspections**:\n   - Ensuring all plumbing work meets local building codes and regulations[2][4].\n\n10. **Custom Service Agreements**:\n    - Tailoring service agreements to meet the unique needs of commercial properties, including yearly or bi-annual inspections[4].\n\nThese services are based on the typical offerings of commercial plumbers and the specific details provided about HydroTech Plumbing LLC.",
  "strickland-plumbing-maintenance": "Based on the provided details, Strickland Plumbing & Maintenance in Mc Calla, AL, offers the following potential plumbing services:\n\n1. **Emergency Plumbing Services**: Available for urgent issues like burst pipes, leaks, and other critical problems.\n2. **Leak Detection and Repair**: Identifying and fixing leaks in pipes, faucets, and appliances.\n3. **Drain Cleaning**: Clearing clogs and blockages in drains to ensure proper water flow.\n4. **Water Heater Installation and Repair**: Services for installing new water heaters and repairing existing ones.\n5. **Toilet Repair and Installation**: Fixing or replacing toilets, including issues with flushing mechanisms and tank problems.\n6. **Sewer Line Inspection and Repair**: Diagnosing and fixing issues with sewer lines to prevent backups and overflows.\n7. **Faucet Installation and Repair**: Replacing or fixing faucets, including kitchen and bathroom sinks.\n8. **Garbage Disposal Installation and Repair**: Services for installing new garbage disposals and repairing existing ones.\n9. **Pipe Installation and Replacement**: Installing new pipes for plumbing systems and replacing old or damaged pipes.\n10. **Maintenance Services**: Regular maintenance checks to prevent future plumbing issues and ensure the longevity of plumbing systems.\n\nThese services are typically offered by a professional plumbing company like Strickland Plumbing & Maintenance, based on their category and subtype as a plumber and home improvement store[1].",
  "forceUpdateTimestamp": 1737002242.61047
}